#!/usr/bin/env python
# -*- coding: UTF-8 -*-
'''=================================================
@Author ：kw
@IDE    ：PyCharm
@Date   ：2023/7/8 22:19
=================================================='''
def test():
    '''
    1、小数位保持
    :return:
    '''
    # % 格式化浮点数，保留0位小数
    print('%.0f' % 123.444)  # 123.4
    # % 格式化浮点数，保留1位小数
    print('%.1f' % 123.444)  # 123.4
    # % 格式化浮点数，保留2位小数
    print('%.2f' % 123.444)  # 123.44
    # % 格式化浮点数，保留3位小数
    print('%.3f' % 123.444)  # 123.444

    # % 格式化浮点数，默认保留6位小数
    print('%1f' % 123.444)  # 123.444000
    # % 格式化浮点数，默认保留6位小数
    print('%3f' % 123.444)  # 123.444000
    # % 格式化浮点数，默认保留6位小数
    print('%6f' % 123.444)  # 123.444000

